[Language]
DisplayName=中文

[FontSizeDlg]
Caption=AI 助手字号设置
TabMain=主窗口 AI
TabStand=独立 AI 窗口
GrpSync=同步缩放
GrpBody=正文
GrpCard=命令卡片
GrpResult=执行结果
GrpCode=代码块
BtnDefault=恢复默认
OK=确定
Cancel=取消

[AI]
NoApiKey=<div style='color:red;'>[Error] No API Key configured for %s. Please go to File > Settings > AI Assistant to configure it.</div>
ReadyMsg=AI Assistant Ready<br><span style='font-size:13px;'>Ask me anything about this toolbox!</span>
[AboutDlg]
BtnOK=确定
Copyright=版权所有 (C) 2026
Version=PowerBox，版本 1.0
[AutoClicker]
StatusClicking=正在点击 (按 %c 停止)
StatusStopped=已停止
StatusWaiting=等待触发 (按 %c 开始, %c 停止)
StoppedMsg=连点已停止
StoppedTitle=连点器
VbsPrompt=点击频率：(ms/次)
VbsTitle=连点器
LabelInterval=间隔(ms):
[BatchRename]
AiDlgCleanedIllegal=\n清理了 %d 个含非法字符的文件名。
AiDlgDesc=描述你的重命名需求（支持自然语言）：
AiDlgNoValidMapping=AI 没有生成有效的重命名映射。\n跳过了 %d 个无效/重复条目。
AiDlgPreview=AI 建议的新文件名预览：
BtnAiAssistant=AI助手
BtnAiSend=发送给AI
BtnApply=应用
BtnBrowse=浏览
BtnCancel=取消
BtnClear=清空
BtnClearDelete=清除删除标记
BtnClearIgnore=取消全部忽略
BtnClearTrack=取消全部跟踪
BtnDelete=删除
BtnDeleteDir=删除目录
BtnDeselectAll=取消全选
BtnExecute=执行
BtnMove=移动
BtnMoveDir=移动目录
BtnPreview=预览
BtnRefresh=刷新
BtnRegexHelp=正则表达式手册
BtnRename=重命名
BtnRenameDir=重命名目录
BtnResetAll=全部重置
BtnSelectAll=全选
BtnUndo=撤销
CheckIgnoreExt=忽略后缀(英文;相隔)
CheckIgnoreMatch=忽略匹配(包括后缀)
CheckInvert=反选
CheckTrackExt=跟踪后缀(英文;相隔)
CheckTrackMatch=跟踪匹配(包括后缀)
ColNew=新文件名
ColOriginal=原文件名
ColSerial=#
ColFolderName=文件夹名
ColStatus=状态
Confirm=确认
DeleteMatchLabel=匹配删除
GroupIgnore=忽略规则
GroupTrack=跟踪规则
IgnoreExtLabel=忽略扩展名
IgnoreMatchLabel=忽略匹配
LabelCurrentDir=当前目录:
LabelFolder=文件夹:
LabelStartNum=起始:
LabelSubdir=子目录操作:
LabelTip=提示: 扩展名不会被修改, 右键文件列表可标记删除/忽略/跟踪
NumberAfterExt=编号在扩展名后
NumberLabel=自动编号
PrefixLabel=前缀
RegexLabel=正则
ReplaceFromLabel=替换
ReplaceToLabel=为
ResetAllConfirm=确定要清除所有改动吗？\n将重置前缀、后缀、替换、序号、删除标记、AI 生成名称。
SelectFolderFirst=请先选择文件夹加载文件列表。
SuffixLabel=后缀
TabFile=文件批量处理
TabFolder=文件夹操作
TrackExtLabel=跟踪扩展名
TrackMatchLabel=跟踪匹配
RenameFolder=重命名
MoveTo=移动
MarkedDeleted=标记删除
LocateInExplorer=在资源管理器中打开
SelectAll=全选
DeselectAll=取消全选
Ignore=忽略
Unignore=取消忽略
Track=跟踪
Untrack=取消跟踪
MarkDelete=标记删除
UnmarkDelete=取消删除标记
ChangeExt=修改扩展名
RestoreExt=恢复原始扩展名
MoveUpOne=上移一个
MoveUpTo=移动到指定位置
MoveUpMenu=上移
MoveDownOne=下移一个
MoveDownTo=移动到指定位置
MoveDownMenu=下移
AiAnalyze=AI分析
CancelAiMark=取消AI标记
BrowseTitle=选择文件夹
DragFolderOnly=请拖入文件夹，不支持拖入文件。
Tip=提示
SelectedCount=已选 %d / %d 个文件夹
SelectFoldersFirst=请先勾选要操作的文件夹。
EnterNewFolderName=输入新文件夹名称：
InvalidFolderName=文件夹名无效。
Error=错误
RenameFailed=重命名失败。
Result=结果
RenameResult=重命名完成：成功 %d 个，失败 %d 个。
SelectFoldersToMove=请先勾选要移动的文件夹。
SelectTargetFolder=选择目标文件夹
MoveResult=移动完成：成功 %d 个，失败 %d 个。
SelectFoldersToDelete=请先勾选要删除的文件夹。
ConfirmDeleteFolders=确定要删除选中的 %d 个文件夹吗？\n此操作不可撤销！
ConfirmDelete=确认删除
DeleteResult=删除完成：成功 %d 个，失败 %d 个。
EnterNewDirName=输入新目录名：
RenameCurrentDir=重命名当前目录
InvalidDirName=目录名无效。
ConfirmMoveDir=确定要将 "%s" 移动到 "%s"？
ConfirmMove=确认移动
MoveFailed=移动失败。
MoveSuccess=移动成功！
ConfirmDeleteCurrentDir=确定要删除当前目录 "%s" 吗？\n此操作不可撤销！
MoveToRecycleFailed=移动到回收站失败。
DeleteSuccess=删除成功！
AlreadyAtTop=已在顶部。
EnterTargetPosition=输入目标位置 (1~%d)：
EnterValidNumber=请输入有效数字 (1~%d)。
AlreadyAtBottom=已在底部。
EnterTargetPositionRange=输入目标位置 (%d~%d)：
MoveToBottom=移动到末尾
EnterValidNumberRange=请输入有效数字 (%d~%d)。
ColCurrentName=当前文件名
ColAiSuggestion=AI 建议新名
AiDlgStatus=共 %d 个文件
AiDlgEnterDesc=请先输入重命名描述。
AiDlgWaiting=正在请求 AI，请稍候...
AiDlgEmptyResponse=AI 返回为空，请重试。
AiDlgGenerated=已生成 %d 个映射
AiDlgNoJson=AI 未返回有效 JSON，请重试。
AiDlgParseError=解析 AI 返回的 JSON 失败。
AiDlgParseErrorTitle=解析错误
AiDlgInvalidJson=AI 返回的 JSON 格式无效。
AiDlgWarning=警告：
AiDlgSkipped=跳过了 %d 个无效条目。
AiDlgIllegal=清理了 %d 个含非法字符的文件名。
AiDlgDupFixed=修正了 %d 个重复项。
AiDlgProcessNote=处理提示
AiDlgJsonParseFail=JSON 解析失败：%s
AiDlgUnchanged=(保持不变)
AiDlgSendFirst=请先发送描述给 AI。
AiDlgConflict=文件名 "%s" 已存在（冲突）。
AiDlgConflictTitle=文件名冲突
AiDlgDuplicate="%s" 在列表中重复。
AiPrefix=[AI] 
Ignored=已忽略
TrackPrefix=[跟踪] 

PreviewFirst=请先预览以确认结果。
ConfirmExecute=将删除 %d 个文件并重命名 %d 个文件。是否继续？
DuplicateNames=新文件名存在重复。请检查规则。
ConfirmRename=确定要执行重命名吗？
OperationResult=操作完成：删除 %d 个（失败 %d），重命名 %d 个（失败 %d）。
RenameSuccess=重命名成功！
AiGeneratedNames=AI 已为 %d 个文件生成新名称。请预览后点击执行。
AiAssistant=AI助手
SelectFilesFirst=请先选择文件。
InvalidExt=扩展名包含非法字符。
NoFilesToRename=没有可重命名的文件（所有文件已被忽略或标记删除）。
EnterNewExt=输入新扩展名（不含点）：
ChangeExtTitle=修改扩展名

UndoConfirm=确定要撤销上次重命名操作吗？
UndoResult=撤销完成：成功 %d 个，失败 %d 个。
UndoTitle=撤销

[ClipboardTab]
ColType=类型
ColText=内容
[ContextMenu]
BtnDelete=删除
BtnDictOpen=打开字典
BtnDictPath=字典路径
BtnHistory=历史记录
BtnLocate=定位
BtnQuery=查询
RClickLocateReg=定位(注册表)
BtnRebuild=重建字典
BtnRefresh=刷新
BtnUndo=撤销
ColCommand=命令
ColDisplayName=显示名称
ColKeyName=键名
ColLocation=位置
ColType=类型
ColVisibility=可见性
Disabled=已禁用
Enabled=已启用
Extended=扩展
ExtensionPlaceholder=输入后缀名(可省略.)
FolderMenuLabel=文件夹右键菜单: 用本程序打开
Hidden=隐藏
LabelLocation=位置筛选:
RClickAiAnalyze=AI解析
RClickCustomParse=自定义名称解析
RClickDelete=删除
RClickDisable=禁用
RClickDisableSelected=禁用选中
RClickEnable=启用
RClickEnableAll=启用全部
RClickEnableSelected=启用选中
RClickLocate=定位
StatusReady=就绪
TypeShellEx=ShellEx
TypeStatic=静态
Visible=可见
Win11ClassicLabel=Win11经典菜单(Shift右键效果)
SceneAll=全部
SceneFile=文件 (*)
SceneFolder=文件夹(所有文件夹)
SceneVirtualFolder=文件夹(虚拟文件夹)
SceneDirBackground=目录背景
SceneDesktopBg=桌面背景
SceneDrive=驱动器
SceneAllFiles=所有文件
SceneThisPC=此电脑
SceneRecycleBin=回收站
SceneLibrary=库文件夹
SceneUWP=UWP快捷方式
SceneExe=exe 文件
SceneUnknown=未知文件
SceneShortcut=快捷方式
SceneJpg=.jpg / .jpeg (JPEG图片)
ScenePng=.png (PNG图片)
SceneGif=.gif (GIF图片)
SceneBmp=.bmp (BMP图片)
SceneTxt=.txt (文本文件)
ScenePdf=.pdf (PDF文档)
SceneDoc=.doc / .docx (Word文档)
SceneMp4=.mp4 (视频文件)
SceneMp3=.mp3 (音频文件)
SceneZip=.zip / .rar (压缩文件)
SceneExeFile=.exe (可执行文件)
SceneDll=.dll (库文件)
SceneHtml=.html / .htm (网页文件)
StatusFoundItems=发现 %d 个右键菜单项
StatusDictPath=  |  字典: %s
StatusDictEmbeddedCache=  |  字典: 内置 + 缓存 (%s)
StatusDictEmbedded=  |  字典: 内置(硬编码)
StatusQueryExt=查询后缀 %s: 发现 %d 个右键菜单项
StatusFolderMenuAdded=文件夹右键菜单项已添加
StatusFolderMenuRemoved=文件夹右键菜单项已移除
StatusWin11Enabled=Win11经典菜单已启用，正在重启资源管理器...
StatusWin11Disabled=Win11新菜单已恢复，正在重启资源管理器...
StatusToggleFormat=%s: %s
StatusActionEnabled=已启用
StatusActionDisabled=已禁用
StatusDisabledCount=%d 项已禁用
StatusEnabledCount=%d 项已启用
StatusCustomParseDeleted="%s" 的自定义解析已删除
StatusCustomParseSaved="%s" 的自定义解析已保存为: %s
StatusDictPathUpdated=字典文件夹已更新: %s
StatusRebuildProgress=正在重建字典: %d 个CLSID (%d 个场景)，请稍候...
StatusRebuildComplete=字典重建完成: %d/%d 个CLSID已解析 (注册表: %d, COM: %d, 回退: %d)。缓存: %s
StatusRebuildFailed=字典重建完成: %d/%d 个CLSID已解析，但缓存保存失败。
StatusNoClsidFound=未找到ShellEx CLSID，无需重建。
StatusBackupDirFail=无法创建备份目录
MsgBackupFail=创建注册表备份失败，已取消本次操作。
StatusUndoFormat=已撤销: %s
StatusHistoryRecent=... (仅显示最近50条记录)
DictInfoCurrent=当前字典: %s  |  缓存: %s
DictInfoEmbeddedCache=当前字典: 内置 + 缓存  |  缓存: %s
DictInfoEmbedded=当前字典: 内置(硬编码)  |  缓存: %s
InputExtHint=请输入要查询的文件后缀名，如 .mp4、.txt 等
ConfirmDisable=确认禁用
ConfirmEnable=确认启用
ConfirmUndo=确认撤销
ConfirmRebuild=确认重建
MsgNoSelection=请先选择一个项目。
MsgNoHistory=无操作历史。
MsgNoHistoryUndo=没有可撤销的操作。
MsgItemNotFound=找不到对应的菜单项，可能已被删除。
MsgAllSelectedDisabled=所选项目均已禁用。
MsgAllSelectedEnabled=所选项目均已启用。
MsgNoClsid=无法获取该项目的CLSID，无法进行自定义名称解析。
MsgEnterCustomName=CLSID: %s\n当前名称: %s\n\n输入自定义显示名称(留空则删除自定义解析):
MsgDictFolderNotFound=字典文件夹不存在。
MsgCantParseShellExPath=无法解析ShellEx注册表路径。
MsgCantOpenRegKey=无法打开注册表键: %s\n错误代码: %d
MsgCopyRegKeyFailed=复制注册表键失败。\n\n源: %s\%s\n目标: %s\%s
MsgDeleteOldRegFailed=删除旧注册表键失败，已回滚。\n错误代码: %d
MsgUnrecognizedShellEx=无法识别的ShellEx文件夹: %s
MsgAiNoApiKey=请先在 文件→设置→AI助手 中配置API Key。
MsgAiAnalyzeFail=AI分析失败: %s
MsgAiAnalyzeResult=AI分析结果
MsgConfirmDisableCount=确定要禁用 %d 个右键菜单项吗？\n禁用后可通过右键菜单重新启用。
MsgConfirmEnableCount=确定要启用 %d 个右键菜单项吗？
MsgCriticalWarning=警告：部分选中项是系统关键右键菜单项！\n\n禁用它们可能会影响正常的Windows资源管理器行为。\n修改前将自动创建注册表备份。\n\n确定要继续吗？
MsgCriticalWarningTitle=严重警告 - 确认禁用
MsgUndoConfirm=确定要撤销以下操作吗？\n\n时间: %s\n操作: %s\n项目: %s\n详情: %s\n\n这将恢复项目到之前的状态。
MsgUndoConfirmTitle=确认撤销
MsgOpenSourceParentFail=无法打开源注册表键。
MsgCreateTargetFail=无法创建目标注册表键。
MsgRebuildPrompt=将扫描所有已注册的ShellEx CLSID并通过注册表和COM接口解析显示名称。\n此过程可能需要几秒钟，是否继续？
MsgHistoryTitle=操作历史 (最近在先)
CustomParseTitle=自定义名称解析
RebuildTitle=重建字典
AiAnalyzeTitle=AI分析
AiPromptHeader=分析Windows右键菜单注册表项:
AiPromptScene=场景: %s
AiPromptKeyName=键名: %s
AiPromptDisplayName=显示名称: %s
AiPromptCommand=命令: %s
AiPromptType=类型: %s
AiPromptFooter=猜测此右键菜单项属于哪个软件及提供什么功能。30字以内回答。
MsgConfirmDisable=确认禁用

[ConvHistory]
BtnClose=关闭
LabelTruncate=标签截断:
BtnCount=数量：%d/%d
ConfirmDeleteMultiple=确定要删除选中的 %d 个项目吗？
RClickDeleteSelected=删除选中 (%d)
RClickUpSelected=上移选中 (%d)
RClickDownSelected=下移选中 (%d)
MaxItemsReached=已达到最大数量（%d个），无法继续添加。
BtnDelete=删除
BtnLoad=加载
BtnPath=保存位置
BtnRename=重命名
ColCreated=创建时间
ColModified=修改时间
ColTitle=标题
RClickDelete=删除
RClickLoad=加载
RClickRename=重命名
UnnamedTitle=未命名对话
ColMessageCount=消息数
ColUpdated=更新时间
SaveLocation=保存位置: 
ConfirmDeleteConv=确定要删除对话 "%s" 吗？
ConfirmDeleteTitle=确认删除对话
DeleteMultiple=确定要删除选中的 %d 个对话吗？

SelectConvFirst=请先选择一个对话。
RenameTitle=重命名对话
EnterNewTitle=请输入新的对话标题：
LoadSingleOnly=加载仅支持单选。
RenameSingleOnly=重命名仅支持单选。

[DlgCaption]
AboutDlg=关于 PowerBox
AiRenameDlg=AI 批量重命名助手
BatchRenameDlg=文件夹处理（支持拖入文件夹）
ClickSpeedDlg=连点器速度
ContextMenuDlg=右键菜单管理器
ConvHistoryDlg=对话历史
EncodingDlg=编码转换器
EnvVarDlg=环境变量管理
EnvVarEditDlg=环境变量
EnvVarPathEditDlg=编辑 PATH 变量
FileLockDlg=文件占用查看
GitCmdDlg=Git 命令
InputDlg=输入
MainDlg=PowerBox
MarkdownDlg=Markdown Preview
OCRDlg=截图OCR
ProcessAiResultDlg=AI进程分析结果
ProcessScanDlg=AI进程扫描结果
QRCodeDlg=二维码生成
RegexGuideDlg=正则表达式规则指南
SettingsDlg=配置
StickyNoteDlg=简易便签
AIAssistantDlg=AI 助手
[Encoding]
BtnConvert=转换
BtnOpen=打开
BtnOverwrite=覆盖
BtnSaveAs=另存为
LabelDstEnc=目标编码:
LabelSrcEnc=源编码:
[EnvVar]
BtnAdd=添加
BtnDelete=删除
BtnEdit=编辑
BtnExport=导出
BtnRefresh=刷新
ColName=变量名
ColValue=变量值
LabelSearch=搜索:
RClickCopyName=复制名称
RClickCopyValue=复制值
RClickDelete=删除
RClickCopy=复制
RClickEdit=编辑
RClickMoveUp=上移
RClickMoveDown=下移
SearchPlaceholder=搜索环境变量...
SystemLabel=系统变量
UserLabel=用户变量
PathListCol=路径条目
StatusRefreshed=已刷新
StatusTotal=系统: %d 个  用户: %d 个
StatusSearch=搜索 "%s": 系统 %d/%d  用户 %d/%d
StatusAdded=已添加 %s 变量: %s (备份: %s)
StatusUpdated=已更新 %s 变量: %s (备份: %s)
StatusDeleted=已删除 %s 变量: %s (备份: %s)
StatusCopiedName=已复制变量名: %s
StatusCopiedValue=已复制变量值: %s
StatusExported=已导出到: %s
ErrNameEmpty=变量名不能为空。
ErrSelectEdit=请先选择要编辑的路径条目。
ErrSelectDelete=请先选择要删除的路径条目。
ErrSelectVar=请先选择一个环境变量。
ErrSelectVarDel=请先选择要删除的环境变量。
ErrWriteFail=写入环境变量失败: %s
ErrDeleteFail=删除环境变量失败: %s
ErrCreateFile=无法创建文件，请检查权限。
DlgAddTitle=添加环境变量
DlgEditTitle=编辑环境变量
DlgWriteFail=写入失败
DlgDeleteFail=删除失败
DlgExportFail=导出失败
DlgConfirmDelete=确认删除
ConfirmAddType=添加到系统变量(是)还是用户变量(否)？
ConfirmDeleteVar=确定要删除 %s 变量 "%s" 吗？\n此操作不可撤销，建议先导出备份。
PathEditTitle=编辑 %s - PATH 变量
PathSelectFolder=选择要添加的文件夹路径
PathSelectNewFolder=选择新的文件夹路径
ExportFilter=文本文件 (*.txt)|*.txt|所有文件 (*.*)|*.*||
[FileLock]
BtnClear=清除
BtnEnd=结束
BtnEndAll=全部结束
BtnLocate=定位
BtnRefresh=刷新
ColFilePath=文件路径
ColPID=PID
ColProcessName=进程名
ColProcessPath=进程路径
ColType=进程类型
Hint=拖放文件到此处查看占用进程（需管理员权限）
AppTypeScanning=扫描中...
AppTypeMainWindow=主窗口
AppTypeOtherWindow=其他窗口
AppTypeService=服务
AppTypeExplorer=资源管理器
AppTypeConsole=控制台
AppTypeCritical=关键进程
AppTypeUnknown=未知
AppTypeLocked=已锁定
AppTypeNotLocked=未锁定
AppTypeNotFound=未找到
HintLoaded=已加载 %d 个文件，%d 个占用进程
[FileTab]
DropHint=拖拽文件到此
[Filter]
RegexCheck=正则
RegexHelp=帮助
[GitCmdDlg]
BtnAddCmd=添加命令
BtnAiAsk=提问
BtnClearCmds=清空
BtnClose=关闭
LabelTruncate=标签截断:
BtnCount=数量：%d/%d
ConfirmDeleteMultiple=确定要删除选中的 %d 个项目吗？
RClickDeleteSelected=删除选中 (%d)
RClickUpSelected=上移选中 (%d)
RClickDownSelected=下移选中 (%d)
MaxItemsReached=已达到最大数量（%d个），无法继续添加。
BtnCopyOutput=复制输出
ColCmd=命令
ColDesc=说明
LabelAiAsk=向AI提问:
LabelCmdList=命令列表 (右键执行/复制/编辑/删除):
LabelWorkDir=工作目录:
OutputLabel=输出:
RClickCopy=复制命令
RClickDelete=删除命令
RClickDeleteSelected=删除选中命令
RClickEdit=编辑命令
RClickExecute=执行命令
RClickExecuteSelected=执行选中命令
StatusReady=状态: 准备就绪
LabelCmdInput=命令输入:
BtnCmdExecute=执行
BtnCmdInputClear=清空
StatusAiGenerating=AI 正在生成中...
StatusAiGenResult=已添加 %d 条 AI 生成的命令

[GitCommands]
Cmd10Desc=暂存所有更改
Cmd11Desc=提交到本地仓库
Cmd12Desc=推送到远程
Cmd13Desc=列出所有分支（含远程）
Cmd14Desc=创建并切换分支
Cmd15Desc=切换分支
Cmd16Desc=合并分支到当前
Cmd17Desc=删除已合并分支
Cmd18Desc=查看简洁提交日志
Cmd19Desc=恢复工作区文件
Cmd1Desc=初始化本地仓库
Cmd20Desc=取消暂存文件
Cmd2Desc=暂存所有文件
Cmd3Desc=提交到本地仓库
Cmd4Desc=添加远程仓库
Cmd5Desc=分支重命名为 main
Cmd6Desc=推送并设置上游
Cmd7Desc=拉取远程更新
Cmd8Desc=克隆远程仓库
Cmd9Desc=查看状态
[GitExec]
Cancelled=状态: 已取消
ConfirmMsg=确定要执行以下命令？\n\n命令: %s\n工作目录: %s
ConfirmTitle=确认执行
Done=状态: 已完成
Failed=状态: 执行失败
Running=状态: 运行中...
ConfirmMsgBatch=确定要执行选中的 %d 条命令吗？

[GitTab]
ClearPath=清空路径
CmdWindow=命令窗口
ColCmd=命令
ColDesc=说明
DefaultDir=(默认)
GitBash=git bash
Locate=定位
OpenGitHub=打开github
[MainDlg]
MainDlg=PowerBox
TitleFormat=%s (%s 唤起此窗口)
QuickTab1=AI助手
QuickTabLaunch=快捷打开
QuickTab2=系统
QuickTab3=工具
Tab1=进程管理
Tab2=启动项管理
Tab3=剪贴板
Tab4=窗口处理
Tab5=文件管理
Tab6=git工具箱
[MainCtrl]
BtnRegex=正则
BtnAiScan=AI扫描
BtnRegexHelp=帮助
BtnNextTrack=下一首
BtnPrevTrack=上一首
LabelShutdown=关机
BtnExecute=执行
BtnCancelShutdown=解除关机
LabelHourUnit=时
LabelMinuteUnit=分
LabelSecondUnit=秒
LabelVolume=音量
BtnApply=应用
BtnMute=静音
LabelSystem=系统
BtnTaskManager=任务管理器
LabelCmdLine=命令行
LabelRunCmd=运行
LabelMedia=媒体
LabelOther=其他
BtnAutoClicker=连点器
BtnAutoClickerStop=停止连点
BtnRun=运行
BtnClear=清空
BtnSend=发送
BtnStop=停止
BtnNewChat=新对话
BtnHistory=对话历史
BtnStandalone=独立窗口
LabelLocateHint=点击定位窗口按钮后点击目标窗口
GroupGenerate=生成文件副本
BtnGenerate=生成
BtnLocateWindow=定位窗口
DropHint=拖拽文件到此
CheckAutoStart=开机自启动
CheckAutoOpenSticky=自动打开便签
CheckTopmost=窗口置顶
CheckPreventLock=禁止自动锁屏
GroupRename=修改文件名
BtnModify=修改
BtnDelete=删除
BtnCopyTo=复制到
BtnMoveTo=移动到
GroupCopyMove=复制 / 移动
GroupFileHash=文件哈希校验
HashCalc=计算
HashCopy=复制
HashResult=计算结果
GitDropHint=拖拽文件夹或文件目录到此
[Markdown]
BtnOpen=打开
ExecuteBtn=执行
StatusReady=就绪
PurposeLabel=用途：
RiskLevelLabel=风险等级：
TerminalLabel=终端：
TerminalAuto=自动
CopyCode=复制
CodeCopied=已复制
RiskLow=低
RiskMedium=中
RiskHigh=高
[Menu]
Exit=退出(&X)
File=文件(&F)
Help=帮助(&H)
HelpAbout=关于...(&A)
HelpGitHub=GitHub(&G)
HelpRegex=正则表达式规则(&R)
HelpShortcuts=快捷键列表(&K)
Open=打开(&O)
OpenGitBash=Git Bash(&G)
OpenPowerShell=PowerShell(&P)
OpenWSL=WSL(&S)
Settings=设置...(&S)
Tools=工具(&T)
ToolsBatchRename=文件夹处理(&R)
ToolsContextMenu=右键菜单管理(&R)
ToolsEncoding=编码转换(&E)
ToolsEnvVar=环境变量管理(&E)
ToolsFile=文件工具(&F)
ToolsFileLock=文件占用查看(&F)
ToolsImage=图像工具(&I)
ToolsMarkdown=Markdown 预览(&M)
ToolsQRCode=二维码生成(&Q)
ToolsScreenshotOCR=截图OCR(&O)
ToolsStickyNote=简易便签(&N)
AddStartup=添加启动项
DeleteStartup=删除启动项
CopyPath=复制路径
CopyValue=复制值
Untopmost=取消置顶
Topmost=置顶
Delete=删除
ToolsSystem=系统工具(&S)
ToolsText=文本工具(&T)
View=视图(&V)
ViewClipboard=剪贴板(&C)
ViewFile=文件管理(&F)
ViewGit=git工具箱(&G)
ViewProcess=进程管理(&P)
ViewStartup=启动项管理(&S)
ViewWindow=窗口处理(&W)
Window=窗口(&W)
WindowClose=关闭选中窗口(&C)
WindowLocate=窗口定位(&L)
WindowUntopmost=取消全部置顶(&T)
MenuMinimizeToTray=最小化到托盘(&M)
[Msg]
CreateDlgFailed=创建对话框失败
AccessDenied=权限不足
AiAnalysisFailed=AI分析失败: 
AiCmdConfirmFmt=AI 请求执行以下命令：\n\n命令：%s\n\n用途：%s\n\n风险等级：%s
AiScanFailedMsg=AI扫描失败，请检查网络连接和API密钥。\n%s
AiScanFailedStatus=AI扫描失败: %s
AnalyzingProcesses=正在分析 %d 个进程，请稍候...
BatchEndResult=已结束 %d 个进程，失败 %d 个。
Cancelled=取消
CannotCreatePipe=错误：无法创建输出管道
CannotGenUniqueName=无法生成唯一文件名，请检查目标目录权限或手动选择不同名称。
CannotGetPID=无法获取进程ID。
CannotOpenProcess=无法打开进程以终止。错误：%s
CmdCancelledFmt=【命令执行结果】\n命令：%s\n状态：已取消（用户未确认）\n
Completed=完成
ConfigApiKeyFirst=请先在设置中配置AI API密钥。
ConfigDefaultName=请先在 文件→设置→文件命名 中配置默认文件名。
ConfirmBatchEnd=确认批量结束
ConfirmDelete=确认删除
ConfirmEndProcess=确定要结束进程\n%s (PID: %s) 吗？
ConfirmEndSameName=确定要结束所有 \"%s\" 进程吗？\n共 %d 个实例。
ConfirmForceKill=确定要强制结束进程 PID=%u 吗？\n未保存的数据可能会丢失。
ConfirmForceKillTitle=确认强制结束
ConfirmRemoveStartup=确定要删除启动项\n%s 吗？
ConfirmRemoveStartupDanger=危险操作！即将删除启动项：\n%s\n位置：%s\n删除前会自动备份（注册表值导出为 .reg，启动文件夹文件移入回收站）。\n确定要继续吗？
StartupBackupFailed=创建注册表备份失败，已取消删除操作。
StartupToggleFail=启用/禁用启动项失败，请检查权限。
StartupRemovedWithBackup=启动项已删除。\n注册表备份已保存到：\n%s
CopyFail=生成副本失败，错误代码：%u
CopySuccess=生成副本成功！\n保存路径：%s
DeleteConfirm=确定要将以下文件移到回收站？\n%s
DeleteFail=无法删除文件，错误代码：%d
DeleteSuccess=文件已移到回收站。
EnterLocateModeFail=无法进入定位模式。
Error=错误
ExecConfirm=执行确认
ExecFailedErrCode=执行失败，错误代码：%d
ExitCodeFmt=退出代码：%d\n
FileNotFound=请先拖入文件！
HighRiskConfirmText=确认执行
HighRiskPrompt=此操作风险较高，请输入 \"确认执行\" 以继续：
HighRiskWarningTitle=高危操作警告
Info=提示
InputMismatchCancel=输入不匹配，操作已取消。
InvalidJsonCmd=无法解析命令，JSON 格式无效。
InvalidWindow=请先定位一个窗口。
MsgAccessDenied=权限不足
MsgAdminRestartFail=无法以管理员权限重新启动，请手动以管理员身份运行程序。
MsgAiAnalyze=AI分析
MsgAiNoApiKey=AI分析
MsgAiScanFail=AI扫描
MsgAiScanFailed=AI扫描失败，请检查网络连接和API密钥。
MsgBatchEndComplete=批量结束完成
MsgBatchEndConfirm=批量结束确认
MsgCannotBrowse=无法浏览
MsgCannotGenUniqueName=无法生成唯一文件名，请检查目录或手动选择其他名称。
MsgCannotGetAppPath=无法获取应用程序路径。
MsgCannotGetPID=无法获取PID
MsgCannotGetPath=无法获取路径
MsgCannotOpenProcess=无法打开进程
MsgClipboardFail=剪贴板错误
MsgCloseWindow=关闭窗口
MsgCmdWindowFail=无法创建Git命令窗口。
MsgCompleted=完成
MsgConfigApiKey=请先在设置中配置AI API密钥。
MsgConfigApiKeyFirst=请先在设置中配置AI API密钥。
MsgConfigDefaultName=请先在 文件→设置→文件命名 中配置默认文件名。
MsgConfirm=确认
MsgConfirmClose=确认关闭
MsgConfirmDelete=确认删除
MsgConfirmDeleteFile=确认删除
MsgConfirmDeleteStartup=确定要删除启动项吗？
MsgConfirmEndProcessTitle=确认结束进程
MsgConfirmExec=确认执行
MsgConfirmForceKill=确认强制结束
MsgConfirmRemoveStartup=确定要删除启动项吗？
MsgCopySuccess=复制成功
MsgCreateProcessFail=创建进程失败
MsgDeleteSuccess=删除成功
MsgEndAllSameName=结束所有同名进程
MsgEndProcess=结束进程
MsgEndProcessAll=结束所有同名进程
MsgEndProcessTitle=结束进程
MsgEnterLocateModeFail=无法进入定位模式。
MsgError=错误
MsgExecCmd=执行命令
MsgFileNameEmpty=文件名不能为空。
MsgFileNotFound=未找到文件
MsgFileNotFoundBrowse=找不到文件，可能无法访问或进程已退出。
MsgForceKill=强制结束
MsgForceKillFail=强制结束失败
MsgGitBashNotFound=未找到git-bash.exe，请在设置中配置Git Bash路径。
MsgInvalidFileName=文件名或扩展名包含无效字符。
MsgInvalidWindow=无效窗口
MsgLinkFail=无法打开链接
MsgLocate=定位
MsgLocateWindowFirst=请先定位一个窗口。
MsgMoveSuccess=移动成功
MsgNoCompany=无公司信息
MsgNoOrigName=无原始文件名
MsgNoProcessSelected=未选择任何进程
MsgNotAvailable=N/A
MsgOleInitFail=初始化OLE失败，无法使用拖放功能。
MsgPleaseEnterCommand=请输入要运行的命令。
MsgPleaseRefresh=请先刷新进程列表。
MsgPowerShellAdminFail=以管理员权限启动PowerShell失败
MsgPowerShellFail=启动PowerShell失败
MsgPreventLockFail=设置防锁屏失败。
MsgProcessListEmpty=进程列表为空
MsgProcessPathEmpty=进程路径为空。
MsgRefreshProcessList=请先刷新进程列表。
MsgRegAccessFail=无法打开注册表键，请检查权限。
MsgRenameSuccess=重命名成功
MsgResultWindowFail=无法创建结果窗口。
MsgRunCmdFailed=运行命令失败
MsgScanning=扫描中
MsgScreenshotSaved=截图已保存
MsgSelectProcessFirst=请先选择一个进程进行分析。
MsgSetWorkDirFirst=请先设置工作目录。
MsgSigned=有效签名
MsgStartup=启动项
MsgStartupAddFail=添加启动项失败，请检查权限。
MsgStartupAdded=启动项已添加。
MsgStartupRemoveFail=删除启动项失败，请检查权限。
MsgStartupRemoved=启动项已删除。
MsgTargetExists=目标目录已存在同名文件，请删除或更改目标路径。
MsgTargetFileExists=目标文件已存在，请选择其他名称。
MsgTargetNotDir=目标路径不是目录，请选择一个文件夹。
MsgTargetPathInvalid=目标路径无效，请输入或选择一个有效目录。
MsgTaskManagerFail=启动任务管理器失败
MsgTopmostFail=置顶失败
MsgUnsigned=无效/无签名
MsgWSLFail=启动WSL失败，请手动运行wsl.exe
MsgWarning=提示
MsgWindowSizeInvalid=窗口大小无效
MsgYesNo=是/否
NeedAdminRestart=无法以管理员权限重新启动。请手动以管理员身份运行程序。
NeedPermission=需要权限
NoProcessSelected=未选择任何进程。
NoWindowSelected=未选中有效窗口。
OleInitFail=初始化 OLE 失败，无法使用拖放功能。
OutputLabel=输出：\n
ProcessEndFail=结束进程失败：%s
ProcessEnded=进程已成功结束。
ProcessForceKillFail=强制结束进程失败。
ProcessForceKilled=进程已强制结束。
PromptRestartAdminMsg=操作需要管理员权限。是否以管理员权限重新启动程序？
RenameFail=重命名失败，错误代码：%u
RenameSuccess=重命名成功！
ShellPidFailed=无法获取 Shell 进程 ID。
ShellWindowFailed=无法获取 Shell 窗口。
StartupAddFail=添加启动项失败！请检查权限。
StartupAdded=启动项已添加。
StartupRemoveFail=删除启动项失败！请检查权限。
StartupRemoved=启动项已删除。
Success=成功
TopmostFail=置顶失败，可能权限不足或窗口不允许。
Warning=提示
GitMenuExec=执行命令
GitMenuCopy=复制命令
GitMenuEdit=编辑命令
GitMenuDelete=删除命令
DropGitFolderHint=拖拽文件夹或文件目录到此
DropFileHint=拖拽文件到此
GitRepoDetached=HEAD 分离
GitRepoBranch=分支: %s
GitNotRepo=不是 Git 仓库
GitNoWorkDir=请先设置工作目录。
GitCurrentBranch=当前分支: 
GitConfirmExec=确定要执行以下命令？\n\n%s\n\n%s
GitConfirmTitle=确认执行 Git 命令
GitResultWindowFailed=无法创建结果窗口。
GitCmdWindowFailed=无法创建 Git 命令窗口。
GitEditPrompt=编辑命令：
EnterCommand=请输入命令。
ExecCmdFailed=执行命令失败：%s
PreventLockFailed=设置防锁屏失败。
PowerShellConfirm=请选择 PowerShell 打开方式：\n是(Y) - 以管理员身份运行\n否(N) - 普通模式
PowerShellTitle=打开 PowerShell
PowerShellNonAdminFailed=启动 PowerShell 失败：%s
PowerShellAdminFailed=以管理员权限启动 PowerShell 失败：%s
WslLaunchFailed=启动 WSL 失败。
OpenLinkFailed=无法打开链接。
GitNoPathError=请先设置Git工作目录。
GitBashNotFound=未找到 Git Bash，请检查设置。
PleaseSelectProcess=请先选择进程。
ConfirmEndProcesses=确定要结束选中的 %zu 个进程吗？
EndMoreHint=\n（仅显示前 10 个，共 %zu 个进程）
UnsavedDataWarning=\n\n警告：未保存的数据可能会丢失！
NoLockFound=未找到文件占用信息。
ConfirmEndAllLocks=确定要结束所有 %zu 个占用进程吗？
ConfirmEndAllTitle=确认全部结束
None=无
Valid=有效
ValidPrefix=有效（
InvalidNoSig=无效或无签名
ProcInfoFmt=【进程名】%s (PID: %s)\n【路径】%s\n【签名】%s\n【公司】%s\n【原始文件名】%s
AddStartupFail=添加启动项失败！请检查权限。
AiAnalyze=AI分析
AiGenFail=AI生成失败
AiParseError=AI解析错误
AiParseFailMsg=AI解析失败消息
AiScan=AI扫描
AiScanNoContent=AI扫描无内容
AutoStartDisabled=开机自启动已禁用
AutoStartEnabled=开机自启动已启用
BashNotFound=未找到 Bash
BatchEndResultTitle=批量结束结果
CannotGetExePath=无法获取可执行文件路径
CannotGetPath=无法获取路径
CannotOpenProcErr=无法打开进程，错误：%s
CannotOpenProcessSimple=无法打开进程
CannotOpenRegKey=无法打开注册表键
ClipboardFail=剪贴板操作失败
Confirm=确认
ConfirmBatchEndMsg=确定要批量结束选中的进程吗？
ConfirmCloseTitle=确认关闭
ConfirmCloseWindow=确定要关闭选中的窗口吗？
ConfirmEndProcessTitle=确认结束进程
CopyFileSuccess=文件复制成功！
CopySuffix=副本
DeleteStartupFail=删除启动项失败！请检查权限。
DestNotDir=目标路径不是目录
EndAllDone=全部结束操作已完成
EndAllPreviewMore=（还有 %d 个进程）
EndAllResult=已结束 %d 个进程，失败 %d 个。
EndAllResultTitle=全部结束结果
EndAllStep1=正在结束进程 %d/%d...
EndAllStep1Title=正在结束...
EndAllStep2=正在清理 %d 个剩余进程...
EndAllStep2Title=正在清理...
ExitCode=退出代码
FileAlreadyExists=文件已存在
FileNameEmpty=文件名为空
FileNotFoundForProcess=未找到进程对应的文件
FileNotFoundMsg=文件未找到
InputFormatHint=请按格式输入：说明|命令
InvalidDestPath=无效的目标路径
InvalidFileNameChars=文件名包含无效字符
InvalidWindowSize=无效的窗口大小
MoveFail=移动失败，错误代码：%u
MoveSuccess=移动成功！
NoOutput=无输出
NoPathForProcess=进程路径为空
NoProcessToEnd=没有可结束的进程
NoSignature=无数字签名
NoWorkDirSet=未设置工作目录
PipeCreateError=错误：无法创建输出管道
PleaseConfigApiKey=请先配置AI API密钥
PleaseEnterQuestion=请输入问题
ProcessEndFailSimple=结束进程失败
ProcessStartError=进程启动失败，错误代码：%u
RefreshProcessListFirst=请先刷新进程列表
Scanning=扫描中
ScreenshotSavedTo=截图已保存到：%s
TargetFileExists=目标文件已存在
TaskMgrFail=启动任务管理器失败
UnknownError=未知错误

[OCR]
BtnCapture=开始截图
BtnCopy=复制结果
BtnTranslate=翻译 >>
LabelResult=识别结果:
LabelTranslated=翻译结果:
LangChinese=中文
LangEnglish=英文
LangJapanese=日文
LangKorean=韩文
StatusHint=点击按钮后拖拽选择屏幕区域,按ESC取消
TranslateErrConnectServer=翻译失败：无法连接服务器。
TranslateErrCreateRequest=翻译失败：无法创建请求。
TranslateErrInitNetwork=翻译失败：无法初始化网络。
TranslateErrParseResponse=翻译失败：无法解析响应。
TranslateErrPrefix=翻译失败：
TranslateErrResponseFormat=翻译失败：响应格式异常。
TranslateErrTimeout=翻译失败：请求超时或网络错误。
OcrTranslateFail=翻译失败：%s
Tip=提示
TranslateFailPrefix=翻译失败：
TranslateParseFail=翻译结果解析失败
CheckUseAiTranslate=使用AI翻译
AiTranslateNoApiKey=AI翻译：未配置API密钥，请先在设置中配置。
LangPair0=中文 → 英文
LangPair1=中文 → 日文
LangPair2=中文 → 韩文
LangPair3=英文 → 中文
LangPair4=日文 → 中文
LangPair5=韩文 → 中文
TranslateQueryLimitExceeded=翻译内容过长，MyMemory API 拒绝翻译。建议勾选“使用AI翻译”后重试。

[ProcessAiResult]
BtnClose=关闭
LabelTruncate=标签截断:
BtnCount=数量：%d/%d
ConfirmDeleteMultiple=确定要删除选中的 %d 个项目吗？
RClickDeleteSelected=删除选中 (%d)
RClickUpSelected=上移选中 (%d)
RClickDownSelected=下移选中 (%d)
MaxItemsReached=已达到最大数量（%d个），无法继续添加。
BtnCopy=复制结果
BtnSave=保存结果
DefaultFileName=AI分析结果.txt
FileFilter=文本文件 (*.txt)|*.txt|所有文件 (*.*)|*.*||
[ProcessMenu]
AiAnalyze=AI分析
EndProcess=结束进程
EndSameName=结束所有同名进程
Locate=定位
[ProcessScan]
BtnEnd=结束
BtnEndAll=全部结束
BtnLocate=定位
BtnStartScan=开始扫描
ColDescription=分析说明
ColPID=PID
ColProcessName=进程名
ColSecurityLevel=安全等级
LevelAggressive=激进
LevelConservative=保守
LevelLabel=审查级别
LevelStandard=标准
RClickCopyPath=复制路径
RClickEnd=结束进程
RClickLocate=定位
ScanCompleteMsg=扫描完成，请查看结果。
BtnClearCache=清除缓存
PrefilterLabel=本地预过滤（跳过系统/微软签名进程）
CacheCleared=版本信息缓存已清除，下次扫描将重新读取文件版本信息。
ClearCacheConfirm=确定要清除版本信息内存缓存吗？
StatusReadyFormat=就绪

[ProcessTab]
ColCPU=CPU%
ColMemory=内存(KB)
ColName=进程名
ColPID=PID
ColPath=路径
[QRCode]
BtnCopy=复制到剪贴板
BtnGenerate=生成二维码
BtnSave=保存
InputPlaceholder=请输入文本或链接...
LabelInput=输入文本(URL/文字):
[QuickBtn]
NextTrack=下一首
PrevTrack=上一首
[RunCmd]
BtnClear=清空
BtnRun=运行
InputPlaceholder=输入命令...
[Settings]
BtnAiFontSize=AI 字号设置
AIHide=隐藏
AIKey=API Key
AIShow=显示
AIVendor=AI 供应商
BtnBrowse=浏览
BtnCancel=取消
BtnHide=隐藏
BtnOK=确定
BtnShow=显示
DlgTitleScreenshot=选择截图保存目录
DlgTitleSticky=选择便签保存目录
GroupAI=AI助手
GroupAutoClicker=连点器
GroupFileNaming=文件命名
GroupLanguage=语言
GroupPathSettings=路径设置
LabelApiKey=API Key:
LabelClickInterval=连点器间隔(ms):
LabelDefaultName=默认文件名:
LabelLanguage=语言:
LabelScreenshot=截图保存目录:
LabelStartKey=开始键:
LabelStickyDir=便签保存目录:
LabelStopKey=停止键:
LabelVendor=供应商:
LanguageLabel=语言
LanguageRestartHint=切换语言后应用将自动重启。
MsgKeySame=开始键和停止键不能相同，请重新设置。
GroupHotkey=快捷键
LabelHotkeyShowHide=显示/隐藏主窗口:
LabelHotkeyLocate=窗口定位:
BtnHotkeyCapture=捕捉
MsgHotkeyDuplicate=快捷键重复：显示/隐藏主窗口和窗口定位使用了相同的快捷键。请重新设置。
GroupGit=Git
LabelGitBash=Git Bash路径:
DlgTitleGitBash=选择 Git Bash 路径
TabAI=AI 助手
TabAutoClicker=连点器
TabLanguage=语言
TabPath=路径配置
TabScreenshot=截图
TabSites=网址
TabStickyNote=便签
TabTemplate=文件命名
[Shortcut]
ShortcutList=Alt+1~6          - 切换标签页\nF5               - 刷新当前列表\n\n更多功能请查看 视图/工具/窗口 菜单。
ShortcutListTitle=快捷键
[Shutdown]
CustomTime=设定时间关机
Restart1Min=1分钟后重启
Shutdown3Min=默认3分钟关机
[StartupMenu]
Add=添加启动项
AddMachine=添加本机启动项
Enable=启用
Disable=禁用
CopyPath=复制路径
Remove=删除启动项
[StartupTab]
ColCmd=命令(路径)
ColLocation=位置
ColStatus=状态
StatusEnabled=已启用
StatusDisabled=已禁用
ColName=启动项名
[StickyNote]
BtnBrowse=浏览
RClickExit=退出便签
[ToolLaunch]
GitHub=GitHub
PowerShell=PowerShell
WSL=WSL
[TrayMenu]
Exit=退出程序
ShowWindow=显示窗口
Media=媒体
MediaPrev=上一首
MediaNext=下一首
[Volume]
Btn10Percent=10%
BtnApply=应用
BtnMute=静音
OpenTaskMgr=任务管理器
[WindowTab]
ColField=字段
ColIndex=序号
ColTitle=窗口标题
ColType=类型
ColValue=值
ForceKillBtn=强制结束
LocateBtn=定位窗口
RClickCancel=取消
RClickCloseWindow=关闭窗口
RClickDelete=删除
RClickTopmost=置顶
RClickTopmostCancel=取消置顶
RClickTopmostOff=取消置顶
RClickTopmostOn=置顶
ScreenshotBtn=截图到剪贴板
ShortcutContent=Alt+1~6          - 切换标签页\nF5               - 刷新当前列表\n\n更多功能请查看 视图/工具/窗口 菜单。
ShortcutTitle=快捷键
TopmostLabel=置顶[%zu]
TranparencyLabel=透明度: 100%
TransparencyLabel=透明度: %d%%
Handle=句柄
Path=路径
PID=PID
ProcName=进程名
Title=标题

[RegexGuide]
GuideContent========== 正则表达式规则指南 =\r\n\r\n本工具使用 C++ std::regex，默认 ECMAScript 语法（与 JavaScript 正则兼容）。\r\n\r\n【基本语法】\r\n  .        匹配任意单个字符（换行符除外）\r\n  \\d       匹配任意数字 [0-9]\r\n  \\D       匹配非数字\r\n  \\w       匹配字母、数字、下划线 [a-zA-Z0-9_]\r\n  \\W       匹配非单词字符\r\n  \\s       匹配空白字符（空格、制表符等）\r\n  \\S       匹配非空白字符\r\n  [abc]    匹配 a、b 或 c 中的任意一个\r\n  [^abc]   匹配除了 a、b、c 之外的任意字符\r\n  [a-z]    匹配小写字母 a 到 z\r\n\r\n【量词】\r\n  *        匹配前面的表达式 0 次或多次\r\n  +        匹配前面的表达式 1 次或多次\r\n  ?        匹配前面的表达式 0 次或 1 次\r\n  {n}      匹配前面的表达式恰好 n 次\r\n  {n,}     匹配前面的表达式至少 n 次\r\n  {n,m}    匹配前面的表达式 n 到 m 次\r\n\r\n【位置锚定】\r\n  ^        匹配字符串开头\r\n  $        匹配字符串结尾\r\n  \\b       匹配单词边界\r\n\r\n【捕获组与替换】\r\n  (pattern)   捕获组，匹配的内容可在替换中引用\r\n  (?:pattern) 非捕获组，不保存匹配内容\r\n  $1, $2, ... 在替换文本中引用第 1、第 2 个捕获组\r\n  $&           在替换文本中引用整个匹配\r\n\r\n【常用示例】\r\n  删除所有数字:\r\n    查找: \\d+    替换: (空)\r\n\r\n  删除前导序号（如 "01_"）:\r\n    查找: ^\\d+_    替换: (空)\r\n\r\n  将 "IMG_001" 改为 "Photo_001":\r\n    查找: ^IMG    替换: Photo\r\n\r\n  交换 "name_date" 为 "date_name":\r\n    查找: ^(\\w+)_(\\w+)$    替换: $2_$1\r\n\r\n  删除括号及内容:\r\n    查找: \\(.*?\\)    替换: (空)\r\n\r\n  删除末尾编号 "(1)", "(2)":\r\n    查找: \\(\\d+\\)$    替换: (空)\r\n\r\n  将空格替换为下划线:\r\n    查找: \\s+    替换: _\r\n\r\n【注意事项】\r\n  - 替换仅作用于文件名主干（不含扩展名）\r\n  - 扩展名不会被修改\r\n  - 正则无效时，替换规则将被忽略\r\n  - 特殊字符需转义: . * + ? ( ) [ ] { } \\ ^ $ |
[QuickLaunch]
DlgTitle=管理快捷打开项
ColName=名称
ColType=类型
ColPath=路径
BtnAdd=添加
BtnEdit=编辑
BtnDelete=删除
BtnUp=上移
BtnDown=下移
BtnBrowse=浏览
BtnCancel=取消
BtnOK=确定
AddTitle=添加快捷打开项
EditTitle=编辑快捷打开项
NoSelection=请先选择一个项目
ConfirmDelete=确定要删除 "%s" 吗？
ConfirmDeleteTitle=确认删除
ItemNotFound=找不到项目路径：%s
BtnManage=管理
BrowseFolder=选择文件夹
TypeExecutable=可执行文件
TypeFolder=文件夹
TypeUrl=网址
TypeOtherFile=其他文件
BtnChangeIcon=更改图标
BtnResetIcon=恢复默认
SelectIconFile=选择图标文件
LabelName=名称:
LabelType=类型:
LabelPath=路径:
LabelHotkey=唤醒快捷键:
LabelIcon=图标:
BtnHotkey=捕捉
TypeHotkeyOnly=快捷键
ColHotkey=快捷键
RClickAdd=添加
RClickEdit=编辑
RClickDelete=删除
RClickUp=上移
RClickDown=下移
DropHintManage=拖放文件或文件夹到此处快速添加
DropHintAdd=拖放文件或文件夹到此处
BtnClose=关闭
LabelTruncate=标签截断:
BtnCount=数量：%d/%d
ConfirmDeleteMultiple=确定要删除选中的 %d 个项目吗？
RClickDeleteSelected=删除选中 (%d)
RClickUpSelected=上移选中 (%d)
RClickDownSelected=下移选中 (%d)
MaxItemsReached=已达到最大数量（%d个），无法继续添加。

[Hotkey]
CaptureTitle=捕捉快捷键
CapturePrompt=请按下快捷键组合...
CaptureWaiting=等待按键...
BtnClear=清除
KeySpace=空格
KeyEnter=回车
None=无

[Terminal]
Title=终端
Shell=Shell
Clear=清空
Copy=复制
Paste=粘贴
Restart=重启终端
Exited=[进程已退出]

New=新建终端
CloseTab=关闭终端

[SysInfoTab]
GroupSysInfo=系统信息
ColField=项目
ColValue=值
BtnRefresh=刷新
BtnCopy=复制
OS=操作系统
CPU=处理器
Memory=内存
Disk=磁盘
Uptime=运行时间
BootTime=开机时间
ComputerName=计算机名
UserName=用户名
[ClipboardHistory]
DlgCaption=剪贴板历史
SearchPlaceholder=搜索…
BtnCopy=复制
BtnDelete=删除
BtnClear=清空
BtnPin=置顶
MenuPin=置顶
MenuUnpin=取消置顶
BtnSettings=设置
BtnApply=应用设置
ColTime=时间
ColType=类型
LabelMaxEntries=历史条数上限:
LabelSnapshot=启用文件快照
LabelSnapFiles=快照最大文件数:
LabelSnapMB=快照体积上限(MB):
SettingsTip=启用后，文件和图片将复制到本地存档，方便后续恢复。
TabText=文本
TabFiles=文件
TabImage=图片
TabMixed=混合
TabEmpty=(空)
ConfirmDelete=确定删除该条剪贴板记录吗？
ConfirmClear=确定清空全部剪贴板历史吗？此操作不可恢复。